# Flight Data Wrangling
Performed data wrangling and cleaning.
1. check for null and duplicated values.
2. create a new dataset to store cities' longitude and latitude values.
3. create a new column for storing the duration of time in minutes.

In [1]:
# import library
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df= pd.read_csv('Clean_Dataset.csv')

# Research Questions
The aim of our study is to answer the below research questions:
1. Does the price vary with Airlines?
2. How is the price affected when tickets are bought in just 1 or 2 days before departure?
3. Does ticket price change based on the departure time and arrival time?
4. How does the price change with a change in Source and Destination?
5. How does the ticket price vary between Economy and Business class? class?

In [3]:
df.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [4]:
df.shape

(300153, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300153 entries, 0 to 300152
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        300153 non-null  int64
 1   airline           300153 non-null  object
 2   flight            300153 non-null  object
 3   source_city       300153 non-null  object
 4   departure_time    300153 non-null  object
 5   stops             300153 non-null  object
 6   arrival_time      300153 non-null  object
 7   destination_city  300153 non-null  object
 8   class             300153 non-null  object
 9   duration          300153 non-null  float64
 10  days_left         300153 non-null  int64
 11  price             300153 non-null  int64
dtypes: float64(1), int64(3), object(8)
memory usage: 27.5+ MB

In [6]:
# chaking for null value
df.isna().sum()

Unnamed: 0          0
airline             0
flight              0
source_city         0
departure_time      0
stops               0
arrival_time        0
destination_city    0
class               0
duration            0
days_left           0
price               0
dtype: int64

In [7]:
# chaking for duplicate value
df.duplicated().sum()

0

In [8]:
# Chaking number of unique values for each columns
df.nunique()

Unnamed: 0          300153
airline                  6
flight                1561
source_city              6
departure_time           6
stops                    3
arrival_time             6
destination_city         6
class                    2
duration               476
days_left               49
price                12157
dtype: int64

In [21]:
# distribution of total number of flight for classes
df['class'].value_counts()

class
Economy     206666
Business     93487
Name: count, dtype: int64

In [22]:
# distribution of total number of flights for airline
df['airline'].value_counts()

airline
Vistara      127859
Air_India     80892
Indigo        43120
GO_FIRST      23173
AirAsia       16098
SpiceJet       9011
Name: count, dtype: int64

In [23]:

df['flight'].nunique()

1561

In [24]:
# distribution of total number of flight for sourceC_city
df['source_city'].value_counts()

source_city
Delhi        61343
Mumbai       60896
Bangalore    52061
Kolkata      46347
Hyderabad    40806
Chennai      38700
Name: count, dtype: int64

In [25]:
# distribution of total number of flight for destination_city
df['destination_city'].value_counts()

destination_city
Mumbai       59097
Delhi        57360
Bangalore    51068
Kolkata      49534
Hyderabad    42726
Chennai      40368
Name: count, dtype: int64

In [14]:
# crating a new dataset for storing latitude and longitude for source_city and destination_city
data = {
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Hyderabad', 'Bangalore'],
    'Latitude': [28.7041, 19.0760, 22.5726, 13.0827, 17.3850, 12.9716],
    'Longitude': [77.1025, 72.8777, 88.3639, 80.2707, 78.4867, 77.5946]
}

# Create the dataframe
city = pd.DataFrame(data).set_index('City')
city.to_csv('city.csv')

In [16]:
city

           Latitude  Longitude
City
Delhi       28.7041    77.1025
Mumbai      19.0760    72.8777
Kolkata     22.5726    88.3639
Chennai     13.0827    80.2707
Hyderabad   17.3850    78.4867
Bangalore   12.9716    77.5946

In [17]:
# Crating a new column to calculate flight duration in minute.
def minutes(x):
    x = str(x)
    if '.' in x:
        hour = int(x.split('.')[0])
        minute= int(x.split('.')[1])
        return (hour*60+minute)
    else:
        return int(x)

df['duration_minutes']= df['duration'].apply(minutes)

In [18]:
df.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,duration_minutes
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,137
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,153
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,137
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,145
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,153

In [19]:
df.describe()

,Unnamed: 0,duration,days_left,price,duration_minutes
count,300153.000000,300153.000000,300153.000000,300153.000000,300153.000000
mean,150076.000000,12.221021,26.004751,20889.660523,747.196383
std,86646.852011,7.191997,13.561004,22697.767366,431.422537
min,0.000000,0.830000,1.000000,1105.000000,60.000000
25%,75038.000000,6.830000,15.000000,4783.000000,427.000000
50%,150076.000000,11.250000,26.000000,7425.000000,685.000000
75%,225114.000000,16.170000,38.000000,42521.000000,983.000000
max,300152.000000,49.830000,49.000000,123071.000000,3023.000000

In [20]:
df.dtypes

Unnamed: 0            int64
airline              object
flight               object
source_city          object
departure_time       object
stops                object
arrival_time         object
destination_city     object
class                object
duration            float64
days_left             int64
price                 int64
duration_minutes      int64
dtype: object